In [1]:
#from csv

In [3]:
import pandas as pd

In [5]:
df_csv = pd.read_csv('Employee_Salary.csv')

In [7]:
df_csv

    Name  Age  Income($)
0    Ram   27      70000
1  Mohan   29      90000
2  David   30      61000

In [9]:
#from excel
df_excel = pd.read_excel('Employee_Salary.xlsx',sheet_name='Sheet1' )

In [11]:
df_excel

    Name  Age  Income($)
0    Ram   27      70000
1  Mohan   29      90000
2  David   30      61000

In [13]:
#From Python Dictionary
employee_salary_data_dict = {
    'Name': ['Ram','Mohan','David'],
    'Age': [27,29,30],
    'Income($)': [70000,90000,61000]
}

In [15]:
employee_salary_data_dict

{'Name': ['Ram', 'Mohan', 'David'],
 'Age': [27, 29, 30],
 'Income($)': [70000, 90000, 61000]}

In [17]:
df_dict = pd.DataFrame(employee_salary_data_dict)

In [19]:
df_dict

    Name  Age  Income($)
0    Ram   27      70000
1  Mohan   29      90000
2  David   30      61000

In [21]:
#From List of Tuples
employee_salary_data_tpl = [
    ('Ram',27,70000),
    ('Mohan',29,90000),
    ('David',30,61000)
]

In [23]:
employee_salary_data_tpl

[('Ram', 27, 70000), ('Mohan', 29, 90000), ('David', 30, 61000)]

In [26]:
df_list_tpl = pd.DataFrame(employee_salary_data_tpl, columns=['Name','Age','Income($)'])

In [27]:
df_list_tpl

    Name  Age  Income($)
0    Ram   27      70000
1  Mohan   29      90000
2  David   30      61000